# დაწერეთ პროგრამა სადაც შეამოწმეთ, სტუდენტმა ჩააბარა თუ არა ჩააბარა კურსი მათი გამოცდის ქულების მიხედვით. სთხოვეთ მომხმარებელს შეიყვანოს ქულები შუალედური გამოცდისთვის, დასკვნითი გამოცდისთვის და პროექტისთვის. დარწმუნდით, რომ მომხმარებელმა შეიყვანოს სწორი ქულები (პოზიტიური რიცხვები 0-დან 100-მდე) თითოეული კომპონენტისთვის.გამოიყენეთ შემდეგი შეფასების კრიტერიუმები: თუ საშუალო ქულა (20% შუალედური კურსისთვის, 40% საბოლოო და 40% პროექტისთვის) არის 70 ან მეტი, სტუდენტი გაივლის კურსს. თუ საშუალო ქულა 70-ზე დაბალია, სტუდენტი ვერ ახერხებს კურსის ჩაბარებას. აჩვენეთ მომხმარებლისთვის შეტყობინება, რომელშიც მითითებულია მისი გავლის/ჩავარდნის სტატუსი და გამოთვლილი საშუალო ქულა.

middle = int(input("შეიყვანეთ შუალედური გამოცდის ქულა (0-100): "))
final = int(input("შეიყვანეთ დასკვნითი გამოცდის ქულა (0-100): "))
project = int(input("შეიყვანეთ პროექტის ქულა (0-100): "))

if  0 <= middle <= 100:
            print("Scores should be between 0 and 100.")


if  0 <= final <= 100:
            print("Scores should be between 0 and 100.")


if  0 <= project <= 100:
            print("Scores should be between 0 and 100.")

score = int(input ("enter your test score: "))


if score >= 70:
    print("congratulations! You have passed the course")


else:
    print("sorry, but you failed to pass the course")
    